Found 1559 images belonging to 3 classes.
Found 520 images belonging to 3 classes.
Downloading data from https://storage.googleapis.com/tensorflow/keras-applications/vgg16/vgg16_weights_tf_dim_ordering_tf_kernels_notop.h5
    8192/58889256 [..............................] - ETA: 1s  114688/58889256 [..............................] - ETA: 25s  286720/58889256 [..............................] - ETA: 21s 1146880/58889256 [..............................] - ETA: 7s  2588672/58889256 [>.............................] - ETA: 4s 2916352/58889256 [>.............................] - ETA: 5s 4358144/58889256 [=>............................] - ETA: 4s 5431296/58889256 [=>............................] - ETA: 3s 7593984/58889256 [==>...........................] - ETA: 2s 8978432/58889256 [===>..........................] - ETA: 2s10567680/58889256 [====>.........................] - ETA: 2s11894784/58889256 [=====>........................] - ETA: 2s12058624/58889256 [=====>........................] - ETA: 2s14417920/58889256 [======>.......................] - ETA: 2s15056896/58889256 [======>.......................] - ETA: 2s18268160/58889256 [========>.....................] - ETA: 1s19668992/58889256 [=========>....................] - ETA: 1s21200896/58889256 [=========>....................] - ETA: 1s22659072/58889256 [==========>...................] - ETA: 1s24100864/58889256 [===========>..................] - ETA: 1s25264128/58889256 [===========>..................] - ETA: 1s26886144/58889256 [============>.................] - ETA: 1s28180480/58889256 [=============>................] - ETA: 1s29343744/58889256 [=============>................] - ETA: 1s30752768/58889256 [==============>...............] - ETA: 1s31277056/58889256 [==============>...............] - ETA: 1s33652736/58889256 [================>.............] - ETA: 1s35192832/58889256 [================>.............] - ETA: 0s38051840/58889256 [==================>...........] - ETA: 0s39452672/58889256 [===================>..........] - ETA: 0s40894464/58889256 [===================>..........] - ETA: 0s41713664/58889256 [====================>.........] - ETA: 0s44351488/58889256 [=====================>........] - ETA: 0s45957120/58889256 [======================>.......] - ETA: 0s47513600/58889256 [=======================>......] - ETA: 0s49004544/58889256 [=======================>......] - ETA: 0s50339840/58889256 [========================>.....] - ETA: 0s51871744/58889256 [=========================>....] - ETA: 0s53575680/58889256 [==========================>...] - ETA: 0s55164928/58889256 [===========================>..] - ETA: 0s56311808/58889256 [===========================>..] - ETA: 0s58728448/58889256 [============================>.] - ETA: 0s58892288/58889256 [==============================] - 2s 0us/step
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
vgg16 (Functional)           (None, 4, 4, 512)         14714688  
_________________________________________________________________
flatten (Flatten)            (None, 8192)              0         
_________________________________________________________________
dense (Dense)                (None, 3)                 24579     
=================================================================
Total params: 14,739,267
Trainable params: 24,579
Non-trainable params: 14,714,688
_________________________________________________________________
Model compiled, ready for training

Epoch 1/400
1/4 [======>.......................] - ETA: 10s - loss: 1.3207 - accuracy: 0.30432/4 [==============>...............] - ETA: 31s - loss: 1.2036 - accuracy: 0.35753/4 [=====================>........] - ETA: 13s - loss: 1.1793 - accuracy: 0.37814/4 [==============================] - ETA: 0s - loss: 1.1512 - accuracy: 0.4003 4/4 [==============================] - 73s 23s/step - loss: 1.1344 - accuracy: 0.4136 - val_loss: 0.8580 - val_accuracy: 0.5938
Epoch 2/400
1/4 [======>.......................] - ETA: 8s - loss: 0.8723 - accuracy: 0.52172/4 [==============>...............] - ETA: 27s - loss: 0.8310 - accuracy: 0.57883/4 [=====================>........] - ETA: 13s - loss: 0.8098 - accuracy: 0.61284/4 [==============================] - ETA: 0s - loss: 0.7893 - accuracy: 0.6365 4/4 [==============================] - 66s 21s/step - loss: 0.7770 - accuracy: 0.6507 - val_loss: 0.6069 - val_accuracy: 0.7852
Epoch 3/400
1/4 [======>.......................] - ETA: 1:39 - loss: 0.5485 - accuracy: 0.78122/4 [==============>...............] - ETA: 36s - loss: 0.5625 - accuracy: 0.7734 3/4 [=====================>........] - ETA: 16s - loss: 0.5657 - accuracy: 0.77524/4 [==============================] - ETA: 0s - loss: 0.5650 - accuracy: 0.7786 4/4 [==============================] - 103s 23s/step - loss: 0.5645 - accuracy: 0.7807 - val_loss: 0.4450 - val_accuracy: 0.8750
Epoch 4/400
1/4 [======>.......................] - ETA: 7s - loss: 0.5764 - accuracy: 0.73912/4 [==============>...............] - ETA: 24s - loss: 0.5550 - accuracy: 0.76693/4 [=====================>........] - ETA: 11s - loss: 0.5416 - accuracy: 0.78134/4 [==============================] - ETA: 0s - loss: 0.5314 - accuracy: 0.7917 4/4 [==============================] - 76s 24s/step - loss: 0.5253 - accuracy: 0.7980 - val_loss: 0.4678 - val_accuracy: 0.8555
Epoch 5/400
1/4 [======>.......................] - ETA: 43s - loss: 0.4295 - accuracy: 0.87502/4 [==============>...............] - ETA: 25s - loss: 0.4153 - accuracy: 0.88093/4 [=====================>........] - ETA: 15s - loss: 0.4221 - accuracy: 0.87804/4 [==============================] - ETA: 0s - loss: 0.4288 - accuracy: 0.8724 4/4 [==============================] - 85s 23s/step - loss: 0.4329 - accuracy: 0.8690 - val_loss: 0.4080 - val_accuracy: 0.8359
Epoch 6/400
1/4 [======>.......................] - ETA: 39s - loss: 0.4286 - accuracy: 0.85942/4 [==============>...............] - ETA: 30s - loss: 0.4139 - accuracy: 0.86723/4 [=====================>........] - ETA: 14s - loss: 0.4002 - accuracy: 0.87154/4 [==============================] - ETA: 0s - loss: 0.3930 - accuracy: 0.8729 4/4 [==============================] - 78s 22s/step - loss: 0.3887 - accuracy: 0.8737 - val_loss: 0.3286 - val_accuracy: 0.9102
Epoch 7/400
1/4 [======>.......................] - ETA: 42s - loss: 0.3168 - accuracy: 0.92192/4 [==============>...............] - ETA: 22s - loss: 0.3143 - accuracy: 0.91803/4 [=====================>........] - ETA: 11s - loss: 0.3144 - accuracy: 0.91494/4 [==============================] - ETA: 0s - loss: 0.3225 - accuracy: 0.9079 4/4 [==============================] - 73s 19s/step - loss: 0.3274 - accuracy: 0.9036 - val_loss: 0.3644 - val_accuracy: 0.8828
Epoch 8/400
1/4 [======>.......................] - ETA: 39s - loss: 0.3844 - accuracy: 0.86722/4 [==============>...............] - ETA: 30s - loss: 0.3503 - accuracy: 0.88093/4 [=====================>........] - ETA: 14s - loss: 0.3408 - accuracy: 0.88244/4 [==============================] - ETA: 0s - loss: 0.3288 - accuracy: 0.8859 4/4 [==============================] - 87s 24s/step - loss: 0.3216 - accuracy: 0.8880 - val_loss: 0.3178 - val_accuracy: 0.8867
Epoch 9/400
1/4 [======>.......................] - ETA: 45s - loss: 0.2798 - accuracy: 0.9062